Table of Contents
 Interface IIdeaModel
Namespace
IdeaStatiCa.BimApi
Assembly
IdeaStatiCa.BimApi.dll
Model for project to import.
public interface IIdeaModel
Methods
 GetBulkSelection()
Returns currently selected nodes and/or members. At least one of the sets must be non-empty unless the user did not select anything. Set of returned members must be a subset of GetMembers().
BulkSelection GetBulkSelection()
Returns
BulkSelection
 GetLoads()
Returns a set of all loads in the model.
ISet<IIdeaLoading> GetLoads()
Returns
ISet<IIdeaLoading>
Set of all loads in the model.
 GetMembers()
Returns a set of all members in the model.
ISet<IIdeaMember1D> GetMembers()
Returns
ISet<IIdeaMember1D>
Set of all members in the model.
 GetOriginSettings()
Returns information from the original application about the project this class refers to.
OriginSettings GetOriginSettings()
Returns
OriginSettings
Project information
 GetSingleSelection()
Returns currently selected node and/or member. At least one of the sets must be non-empty unless the user did not select anything.Set of returned members must be a subset of GetMembers().
SingleSelection GetSingleSelection()
Returns
SingleSelection
 GetWholeModel()
Returns nodes and/or members from whole model. At least one of the sets must be non-empty unless the user did not select anything. Set of returned members must be a subset of GetMembers().
BulkSelection GetWholeModel()
Returns
BulkSelection
 Edit this page